views/site/description.php

        <?= $model['name'] ?>

        <h4>Город</h4>
        <?= \app\models\Regions::findOne($model['city'])['name'] ?>
---
SELECT * FROM `regions` WHERE `id` IS NULL