views/site/masters.php

SELECT * FROM `regions` WHERE `id`='25'
---
                    </ul>
                    <p>
                        <button type="button" class="btn btn-md btn-primary">Предложить заказ</button>
                        <span class="btn btn-md pull-right">г.<?= \app\models\Regions::findOne($item['city'])['name'] ?></span>

SELECT * FROM `regions` WHERE `id`='none'
---
            <?php
                $selectTitle = 'Выберите регион';
                if (isset($_GET['region']))
                    $selectTitle = \app\models\Regions::findOne($_GET['region'])['name'];