views/site/orders.php

                <p class="p-for-map" style="display:none;">
                    <script type="text/javascript" charset="utf-8" async src="https://api-maps.yandex.ru/services/constructor/1.0/js/?sid=Ho60XGB-iaVDjFYF7aNtky1k6EjRxL0x&amp;width=100%&amp;height=240&amp;lang=ru_RU&amp;sourceType=constructor&amp;scroll=true"></script>
                </p>
                <p class="text-right">Техника: <?= \app\models\Technics::findOne($item['tech'])['name'] ?></p>
---
SELECT * FROM `technics` WHERE `id` IS NULL