views/site/zakazi.php

SELECT * FROM `regions` WHERE `id` IS NULL
---
                    <div class="caption">
                        <h4><?= $item['name'] ?></h4>
                        <p><?= $item['description'] ?></p>
                        <p class="text-right">Город: <?= \app\models\Regions::findOne($item['city'])['name'] ?></p>