models/OrderForm.php

INSERT INTO `opportunities` (`id`, `name`, `city`, `address`, `tech`, `date_closed`, `time`, `clarify`, `currency_id`, `description`, `file`, `date_entered`, `date_modified`) VALUES ('b91d13b6-12ec-0c9a-4218-58b72c7fa306', 'qwe', NULL, 'qwe', '10510532-48db-6b72-8af9-58074f099c86', NULL, '', 0, '-99', 'qwe', '/var/www/html/yii-test/uploads/132.png', '2017-03-01 23:18:21', '2017-03-01 23:18:21')
---
    public function saveRecord($post) {
        date_default_timezone_set('Europe/Moscow');

        $params = [
            'id' => Guid::create_guid(),
            'name' => $post['title'],
            'city' => ($post['city'] == 'none') ? '0' : $post['city'],
            'address' => $post['address'], //+
            'tech' => $post['typeTech'], //+
            'date_closed' => $post['date'],
            'time' => $post['time'], //+
            'clarify' => (!empty($post['clarify'])) ? true : false, //+
            'currency_id' => '-99',
            'description' => $post['description'], //+
            'file' => $this->path, //+
            'date_entered' => date("Y-m-d H:i:s"),
            'date_modified' => date("Y-m-d H:i:s"),
        ];
        try {
            Yii::$app->db->createCommand()->insert('opportunities', $params)->execute();