models/Regions.php

SELECT * FROM `regions`
---
    public function getRegions($reg = 'none') {
        $regions = $this->find()->asArray()->all();