models/Regions.php

    public function getRegions($reg = 'none') {
        $regions = $this->find()->orderBy(['name' => SORT_ASC])->asArray()->all();
---
SELECT * FROM `regions` ORDER BY `name`