models/ZakazForm.php

    public function saveRecord($post) {
        date_default_timezone_set('Europe/Moscow');

        $params = [
            'id' => Guid::create_guid(),
            'name' => $post['name'],
            'email' => $post['email'],
            'city' => $post['city'],
            'address' => $post['address'],
            'method' => implode('', array_values($post['items'])),
            'description' => $post['description'],
            'file' => $this->path,
            'tech' => $post['typeTech'],
            'currency_id' => '-99',
            'date_entered' => date("Y-m-d H:i:s"),
            'date_modified' => date("Y-m-d H:i:s"),
        ];
        try {
            Yii::$app->db->createCommand()->insert('zkz_spares', $params)->execute();
---
INSERT INTO `zkz_spares` (`id`, `name`, `email`, `city`, `address`, `method`, `description`, `file`, `tech`, `currency_id`, `date_entered`, `date_modified`) VALUES ('b1e7b16c-5555-fbc6-1e60-58b7235d8e06', 'qwe@qwe.ru', 'qwe@qwe.ru', '', '', NULL, '', NULL, '10510532-48db-6b72-8af9-58074f099c86', '-99', '2017-03-01 22:39:01', '2017-03-01 22:39:01')